Documents/ПредварительноеСоглашение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПредварительноеСоглашение</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПосещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПоездки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПоездки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоУчастников</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГородаПосещения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГородаМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Агенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Агенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ПредварительноеСоглашение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура АгентПриИзменении(Элемент)
    
    // Если агент выбран (поле не пустое)
    Если ЗначениеЗаполнено(Объект.Агент) Тогда
        
        // Обращаемся к серверу, чтобы вытащить организацию из карточки этого агента
        Объект.Организация = ПолучитьОрганизациюАгента(Объект.Агент);
        
    КонецЕсли;
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОрганизациюАгента(ВыбранныйАгент)
    
    // Точечно считываем реквизит "Организация" из справочника Агенты
    Возврат ВыбранныйАгент.Организация;
    
КонецФункции


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
    
    // 1. Сначала очищаем старого агента, чтобы в поле не остался сотрудник из чужого филиала
    Объект.Агент = ПредопределенноеЗначение("Справочник.Агенты.ПустаяСсылка");
    
    // 2. Настраиваем динамический фильтр для поля Агент
    НовыеПараметры = Новый Массив;
    
    Если ЗначениеЗаполнено(Объект.Организация) Тогда
        // Создаем параметр отбора: ищем реквизит "Организация" внутри справочника Агенты
        НовыйОтбор = Новый ПараметрВыбора("Отбор.Организация", Объект.Организация);
        НовыеПараметры.Добавить(НовыйОтбор);
    КонецЕсли;
    
    // 3. Жестко передаем этот массив отборов в свойства элемента формы Агент
    Элементы.Агент.ПараметрыВыбора = Новый ФиксированныйМассив(НовыеПараметры);
    
КонецПроцедуры


&НаКлиенте
Процедура СтранаПосещенияПриИзменении(Элемент)
    // Очищаем города в табличной части
    Для каждого Строка Из Объект.ГородаПосещения Цикл
        Строка.Город = Неопределено;
    КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ГородаПосещенияГородОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    ТекущиеДанные = Элементы.ГородаПосещения.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    ТекущиеДанные.Город = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура ГородаПосещенияГородНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    // Проверяем, заполнена ли Страна Посещения в шапке документа
    Если ЗначениеЗаполнено(Объект.СтранаПосещения) Тогда
        
        // Устанавливаем фильтр для выбора городов только по этой стране
        НовыйОтбор = Новый ПараметрВыбора("Отбор.Страна", Объект.СтранаПосещения);
        
        МассивПараметров = Новый Массив;
        МассивПараметров.Добавить(НовыйОтбор);
        
        Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
        
    Иначе
        
        // Если страна в шапке не выбрана, очищаем старые фильтры, чтобы увидеть весь список
        Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
        
    КонецЕсли;
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    // Находим Вышегородцева в базе данных
    СсылкаНаКлиента = Справочники.Клиенты.НайтиПоРеквизиту("ФИО", "Вышегородцев Сергей Иванович");
    
    Если Не СсылкаНаКлиента.Пустая() Тогда
        // Принудительно открываем объект на запись и пишем наименование вручную
        ОбъектКлиента = СсылкаНаКлиента.ПолучитьОбъект();
        ОбъектКлиента.Наименование = "Вышегородцев Сергей Иванович";
        ОбъектКлиента.Записать();
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	МассивДокументов = Новый Массив;
	МассивДокументов.Добавить(Объект.Ссылка);
	
	ТабДок = ПечатьНаСервере(МассивДокументов);
	
	Если ТабДок <> Неопределено Тогда
		ТабДок.Показать("Печатная форма соглашения");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервере(МассивДокументов)
	
	ДокОбъект = МассивДокументов[0].ПолучитьОбъект();
	
	Возврат ДокОбъект.Печать(МассивДокументов);
	
КонецФункции
